[Survived] Block removal mutation
AddTwoNumbers.cs:8:5
     public int val;
     public ListNode next;
     public ListNode(int val = 0, ListNode next = null)
-    {
-        this.val = val;
-        this.next = next;
-    }
+    {}
 }
 

[Killed] Arithmetic mutation
AddTwoNumbers.cs:20:19
     {
         int first = GetIntegerFromList(l1);
         int second = GetIntegerFromList(l2);
-        int sum = first + second;
+        int sum = first - second;
         ListNode result = GetListFromInteger(sum);
         return result;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Equality mutation
AddTwoNumbers.cs:29:16
     {
         int result = 0;
         int counter = 0;
-        while (l1.next != null)
+        while (l1.next == null)
         {
             int val = l1.val * (int)System.Math.Pow(10, counter);
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Survived] Arithmetic mutation
AddTwoNumbers.cs:31:23
         int counter = 0;
         while (l1.next != null)
         {
-            int val = l1.val * (int)System.Math.Pow(10, counter);
+            int val = l1.val / (int)System.Math.Pow(10, counter);
             result += val;
             l1 = l1.next;

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
AddTwoNumbers.cs:32:13
         while (l1.next != null)
         {
             int val = l1.val * (int)System.Math.Pow(10, counter);
-            result += val;
+            result -= val;
             l1 = l1.next;
             counter++;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] PostIncrementExpression to PostDecrementExpression mutation
AddTwoNumbers.cs:34:13
             int val = l1.val * (int)System.Math.Pow(10, counter);
             result += val;
             l1 = l1.next;
-            counter++;
+            counter--;
         }
         result += l1.val * (int)System.Math.Pow(10, counter);
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Statement mutation
AddTwoNumbers.cs:34:13
             int val = l1.val * (int)System.Math.Pow(10, counter);
             result += val;
             l1 = l1.next;
-            counter++;
+            ;
         }
         result += l1.val * (int)System.Math.Pow(10, counter);
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Arithmetic mutation
AddTwoNumbers.cs:36:19
             l1 = l1.next;
             counter++;
         }
-        result += l1.val * (int)System.Math.Pow(10, counter);
+        result += l1.val / (int)System.Math.Pow(10, counter);
         return result;
     }
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
AddTwoNumbers.cs:36:9
             l1 = l1.next;
             counter++;
         }
-        result += l1.val * (int)System.Math.Pow(10, counter);
+        result -= l1.val * (int)System.Math.Pow(10, counter);
         return result;
     }
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Equality mutation
AddTwoNumbers.cs:42:13
 
     public ListNode GetListFromInteger(int input)
     {
-        if (input / 10 == 0)
+        if (input / 10 != 0)
         {
             return new ListNode()
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Survived] Arithmetic mutation
AddTwoNumbers.cs:42:13
 
     public ListNode GetListFromInteger(int input)
     {
-        if (input / 10 == 0)
+        if (input * 10 == 0)
         {
             return new ListNode()

[Killed] Arithmetic mutation
AddTwoNumbers.cs:50:26
                 next = null
             };
         }
-        int currentVal = input % 10;
+        int currentVal = input * 10;
         List<ListNode> nodes = new();
         ListNode current = new()
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Negate expression
AddTwoNumbers.cs:57:13
             val = currentVal
         };
         // how do I tell if next exists? 
-        if (input / 10 > 0)
+        if (!(input / 10 > 0))
         {
             current.next = new()
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Equality mutation
AddTwoNumbers.cs:57:13
             val = currentVal
         };
         // how do I tell if next exists? 
-        if (input / 10 > 0)
+        if (input / 10 < 0)
         {
             current.next = new()
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Arithmetic mutation
AddTwoNumbers.cs:61:23
         {
             current.next = new()
             {
-                val = input / 10
+                val = input * 10
             };
             input /= 10;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Survived] DivideAssignmentExpression to MultiplyAssignmentExpression mutation
AddTwoNumbers.cs:63:13
             {
                 val = input / 10
             };
-            input /= 10;
+            input *= 10;
         }
 

[Timeout] Negate expression
AddTwoNumbers.cs:66:16
             input /= 10;
         }
 
-        while (input / 10 > 0)
+        while (!(input / 10 > 0))
         {
             ListNode current2 = new()

[Survived] Arithmetic mutation
AddTwoNumbers.cs:66:16
             input /= 10;
         }
 
-        while (input / 10 > 0)
+        while (input * 10 > 0)
         {
             ListNode current2 = new()

[NoCoverage] Arithmetic mutation
AddTwoNumbers.cs:72:21
             {
                 val = currentVal
             };
-            input = input / 10;
+            input = input * 10;
             if (input == 0)
             {

[NoCoverage] Equality mutation
AddTwoNumbers.cs:73:17
                 val = currentVal
             };
             input = input / 10;
-            if (input == 0)
+            if (input != 0)
             {
                 current2.next = null;

[NoCoverage] Block removal mutation
AddTwoNumbers.cs:74:13
             };
             input = input / 10;
             if (input == 0)
-            {
-                current2.next = null;
-            }
+            {}
             else
             {

[NoCoverage] Arithmetic mutation
AddTwoNumbers.cs:81:27
             {
                 current2.next = new()
                 {
-                    val = input % 10
+                    val = input * 10
                 };
             }
