[Killed] Equality mutation
BubbleSort.cs:7:25
 {
     public static void SortIntegers(int[] input)
     {
-        for (int i = 0; i < input.Length; i++)
+        for (int i = 0; i > input.Length; i++)
         {
             for (int j = 0; j < input.Length - 1; j++)
killedBy: tests.BubbleSortTests.SortThreeElementUnsortedArray

[Survived] Equality mutation
BubbleSort.cs:7:25
 {
     public static void SortIntegers(int[] input)
     {
-        for (int i = 0; i < input.Length; i++)
+        for (int i = 0; i <= input.Length; i++)
         {
             for (int j = 0; j < input.Length - 1; j++)

[Killed] PostIncrementExpression to PostDecrementExpression mutation
BubbleSort.cs:9:51
     {
         for (int i = 0; i < input.Length; i++)
         {
-            for (int j = 0; j < input.Length - 1; j++)
+            for (int j = 0; j < input.Length - 1; j--)
             {
                 if (input[j] > input[j + 1])
killedBy: tests.BubbleSortTests.SortFourElementSortedArray; tests.BubbleSortTests.SortThreeElementSortedArray; tests.BubbleSortTests.SortTwoElementSortedArray

[Killed] Equality mutation
BubbleSort.cs:9:29
     {
         for (int i = 0; i < input.Length; i++)
         {
-            for (int j = 0; j < input.Length - 1; j++)
+            for (int j = 0; j <= input.Length - 1; j++)
             {
                 if (input[j] > input[j + 1])
killedBy: tests.BubbleSortTests.SortFourElementSortedArray; tests.BubbleSortTests.SortThreeElementSortedArray; tests.BubbleSortTests.SortTwoElementSortedArray

[Killed] Negate expression
BubbleSort.cs:11:21
         {
             for (int j = 0; j < input.Length - 1; j++)
             {
-                if (input[j] > input[j + 1])
+                if (!(input[j] > input[j + 1]))
                 {
                     (input[j], input[j + 1]) = (input[j + 1], input[j]);
killedBy: tests.BubbleSortTests.SortFourElementSortedArray; tests.BubbleSortTests.SortThreeElementSortedArray; tests.BubbleSortTests.SortTwoElementSortedArray

[Killed] Arithmetic mutation
BubbleSort.cs:11:38
         {
             for (int j = 0; j < input.Length - 1; j++)
             {
-                if (input[j] > input[j + 1])
+                if (input[j] > input[j - 1])
                 {
                     (input[j], input[j + 1]) = (input[j + 1], input[j]);
killedBy: tests.BubbleSortTests.SortFourElementSortedArray; tests.BubbleSortTests.SortThreeElementSortedArray; tests.BubbleSortTests.SortTwoElementSortedArray

[Killed] Arithmetic mutation
BubbleSort.cs:13:38
             {
                 if (input[j] > input[j + 1])
                 {
-                    (input[j], input[j + 1]) = (input[j + 1], input[j]);
+                    (input[j], input[j - 1]) = (input[j + 1], input[j]);
                 }
             }
killedBy: tests.BubbleSortTests.SortThreeElementUnsortedArray

[Killed] Arithmetic mutation
BubbleSort.cs:13:55
             {
                 if (input[j] > input[j + 1])
                 {
-                    (input[j], input[j + 1]) = (input[j + 1], input[j]);
+                    (input[j], input[j + 1]) = (input[j - 1], input[j]);
                 }
             }
killedBy: tests.BubbleSortTests.SortThreeElementUnsortedArray
