[Survived] String mutation
Entity.cs:6:45
 public abstract class Entity
 {
     public Guid Guid { get; set; } = Guid.NewGuid();
-    public string CreatedBy { get; set; } = "System";
+    public string CreatedBy { get; set; } = "";
     public DateTime CreatedDate { get; set; } = DateTime.UtcNow;
     public string ModifiedBy { get; set; }
