[Timeout] Negate expression
MergeSort.cs:7:13
 {
     public static void SortIntegers(int[] input)
     {
-        if (input.Length <= 1) return;
+        if (!(input.Length <= 1)) return;
         int leftSize = input.Length / 2;
         int rightSize = input.Length - leftSize;

[Timeout] Equality mutation
MergeSort.cs:7:13
 {
     public static void SortIntegers(int[] input)
     {
-        if (input.Length <= 1) return;
+        if (input.Length > 1) return;
         int leftSize = input.Length / 2;
         int rightSize = input.Length - leftSize;

[Killed] Arithmetic mutation
MergeSort.cs:8:24
     public static void SortIntegers(int[] input)
     {
         if (input.Length <= 1) return;
-        int leftSize = input.Length / 2;
+        int leftSize = input.Length * 2;
         int rightSize = input.Length - leftSize;
         int[] left = new int[leftSize];
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Arithmetic mutation
MergeSort.cs:9:25
     {
         if (input.Length <= 1) return;
         int leftSize = input.Length / 2;
-        int rightSize = input.Length - leftSize;
+        int rightSize = input.Length + leftSize;
         int[] left = new int[leftSize];
         int[] right = new int[rightSize];
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Statement mutation
MergeSort.cs:13:9
         int[] left = new int[leftSize];
         int[] right = new int[rightSize];
 
-        Array.Copy(input, 0, left, 0, leftSize);
+        ;
         Array.Copy(input, leftSize, right, 0, rightSize);
 
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Statement mutation
MergeSort.cs:14:9
         int[] right = new int[rightSize];
 
         Array.Copy(input, 0, left, 0, leftSize);
-        Array.Copy(input, leftSize, right, 0, rightSize);
+        ;
 
         SortIntegers(left);
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Survived] Statement mutation
MergeSort.cs:16:9
         Array.Copy(input, 0, left, 0, leftSize);
         Array.Copy(input, leftSize, right, 0, rightSize);
 
-        SortIntegers(left);
+        ;
         SortIntegers(right);
 

[Killed] Statement mutation
MergeSort.cs:17:9
         Array.Copy(input, leftSize, right, 0, rightSize);
 
         SortIntegers(left);
-        SortIntegers(right);
+        ;
 
         Merges(input, left, right);
killedBy: tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Statement mutation
MergeSort.cs:19:9
         SortIntegers(left);
         SortIntegers(right);
 
-        Merges(input, left, right);
+        ;
     }
 
killedBy: tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Arithmetic mutation
MergeSort.cs:27:25
         int leftIndex = 0;
         int rightIndex = 0;
         int targetIndex = 0;
-        int remaining = left.Length + right.Length;
+        int remaining = left.Length - right.Length;
 
         while (remaining > 0)
killedBy: tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Negate expression
MergeSort.cs:29:16
         int targetIndex = 0;
         int remaining = left.Length + right.Length;
 
-        while (remaining > 0)
+        while (!(remaining > 0))
         {
             if (leftIndex >= left.Length)
killedBy: tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Equality mutation
MergeSort.cs:29:16
         int targetIndex = 0;
         int remaining = left.Length + right.Length;
 
-        while (remaining > 0)
+        while (remaining >= 0)
         {
             if (leftIndex >= left.Length)
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Equality mutation
MergeSort.cs:31:17
 
         while (remaining > 0)
         {
-            if (leftIndex >= left.Length)
+            if (leftIndex < left.Length)
             {
                 input[targetIndex] = right[rightIndex++];
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Equality mutation
MergeSort.cs:31:17
 
         while (remaining > 0)
         {
-            if (leftIndex >= left.Length)
+            if (leftIndex > left.Length)
             {
                 input[targetIndex] = right[rightIndex++];
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortFourElementSortedArray

[Killed] PostIncrementExpression to PostDecrementExpression mutation
MergeSort.cs:33:44
         {
             if (leftIndex >= left.Length)
             {
-                input[targetIndex] = right[rightIndex++];
+                input[targetIndex] = right[rightIndex--];
             }
 
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortFourElementSortedArray

[Killed] Equality mutation
MergeSort.cs:36:22
                 input[targetIndex] = right[rightIndex++];
             }
 
-            else if (rightIndex >= right.Length)
+            else if (rightIndex > right.Length)
             {
                 input[targetIndex] = left[leftIndex++];
killedBy: tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Negate expression
MergeSort.cs:36:22
                 input[targetIndex] = right[rightIndex++];
             }
 
-            else if (rightIndex >= right.Length)
+            else if (!(rightIndex >= right.Length))
             {
                 input[targetIndex] = left[leftIndex++];
killedBy: tests.MergeSortTests.SortThreeElementUnsortedArray

[Survived] PostIncrementExpression to PostDecrementExpression mutation
MergeSort.cs:38:43
 
             else if (rightIndex >= right.Length)
             {
-                input[targetIndex] = left[leftIndex++];
+                input[targetIndex] = left[leftIndex--];
             }
 

[Killed] Negate expression
MergeSort.cs:41:22
                 input[targetIndex] = left[leftIndex++];
             }
 
-            else if (left[leftIndex].CompareTo(right[rightIndex]) < 0)
+            else if (!(left[leftIndex].CompareTo(right[rightIndex]) < 0))
             {
                 input[targetIndex] = left[leftIndex++];
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Equality mutation
MergeSort.cs:41:22
                 input[targetIndex] = left[leftIndex++];
             }
 
-            else if (left[leftIndex].CompareTo(right[rightIndex]) < 0)
+            else if (left[leftIndex].CompareTo(right[rightIndex]) > 0)
             {
                 input[targetIndex] = left[leftIndex++];
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] PostIncrementExpression to PostDecrementExpression mutation
MergeSort.cs:51:13
                 input[targetIndex] = right[rightIndex++];
             }
 
-            targetIndex++;
+            targetIndex--;
             remaining--;
         }
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Statement mutation
MergeSort.cs:51:13
                 input[targetIndex] = right[rightIndex++];
             }
 
-            targetIndex++;
+            ;
             remaining--;
         }
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Statement mutation
MergeSort.cs:52:13
             }
 
             targetIndex++;
-            remaining--;
+            ;
         }
     }
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] PostDecrementExpression to PostIncrementExpression mutation
MergeSort.cs:52:13
             }
 
             targetIndex++;
-            remaining--;
+            remaining++;
         }
     }
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray
