[Killed] Block removal mutation
MinimumCoin.cs:9:5
     public int RepeatFactor { get; private set; }
 
     public MinimumCoin(List<int> CoinSet, int RepeatFactor)
-    {
-        this.CoinSet = CoinSet;
-        this.RepeatFactor = RepeatFactor;
-    }
+    {}
 
     private static IEnumerable<IEnumerable<T>> SubSetsOf<T>(IEnumerable<T> source)
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MinimumCoin.cs:16:13
 
     private static IEnumerable<IEnumerable<T>> SubSetsOf<T>(IEnumerable<T> source)
     {
-        if (!source.Any())
+        if (source.Any())
         {
             return Enumerable.Repeat(Enumerable.Empty<T>(), 1);
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Timeout] Block removal mutation
MinimumCoin.cs:17:9
     private static IEnumerable<IEnumerable<T>> SubSetsOf<T>(IEnumerable<T> source)
     {
         if (!source.Any())
-        {
-            return Enumerable.Repeat(Enumerable.Empty<T>(), 1);
-        }
+        {}
 
         IEnumerable<T> element = source.Take(1);

[Killed] Linq method mutation (Take() to Skip())
MinimumCoin.cs:21:34
             return Enumerable.Repeat(Enumerable.Empty<T>(), 1);
         }
 
-        IEnumerable<T> element = source.Take(1);
+        IEnumerable<T> element = source.Skip(1);
 
         IEnumerable<IEnumerable<T>> haveNots = SubSetsOf(source.Skip(1));
killedBy: tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfTwoCoins

[Timeout] Linq method mutation (Skip() to Take())
MinimumCoin.cs:23:58
 
         IEnumerable<T> element = source.Take(1);
 
-        IEnumerable<IEnumerable<T>> haveNots = SubSetsOf(source.Skip(1));
+        IEnumerable<IEnumerable<T>> haveNots = SubSetsOf(source.Take(1));
         IEnumerable<IEnumerable<T>> haves = haveNots.Select(set => element.Concat(set));
 

[Killed] Linq method mutation (Concat() to Except())
MinimumCoin.cs:24:68
         IEnumerable<T> element = source.Take(1);
 
         IEnumerable<IEnumerable<T>> haveNots = SubSetsOf(source.Skip(1));
-        IEnumerable<IEnumerable<T>> haves = haveNots.Select(set => element.Concat(set));
+        IEnumerable<IEnumerable<T>> haves = haveNots.Select(set => element.Except(set));
 
         return haves.Concat(haveNots);
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Killed] Linq method mutation (Concat() to Except())
MinimumCoin.cs:26:16
         IEnumerable<IEnumerable<T>> haveNots = SubSetsOf(source.Skip(1));
         IEnumerable<IEnumerable<T>> haves = haveNots.Select(set => element.Concat(set));
 
-        return haves.Concat(haveNots);
+        return haves.Except(haveNots);
     }
 
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Killed] Linq method mutation (Sum() to Max())
MinimumCoin.cs:35:23
         IEnumerable<IEnumerable<int>> x = SubSetsOf<int>(repeatedList);
         foreach (IEnumerable<int> y in x)
         {
-            int sum = y.Sum();
+            int sum = y.Max();
             if (sum == total && currentCount > y.Count())
             {
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Killed] Equality mutation
MinimumCoin.cs:36:33
         foreach (IEnumerable<int> y in x)
         {
             int sum = y.Sum();
-            if (sum == total && currentCount > y.Count())
+            if (sum == total && currentCount < y.Count())
             {
                 currentCount = y.Count();
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Killed] Equality mutation
MinimumCoin.cs:36:17
         foreach (IEnumerable<int> y in x)
         {
             int sum = y.Sum();
-            if (sum == total && currentCount > y.Count())
+            if (sum != total && currentCount > y.Count())
             {
                 currentCount = y.Count();
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfFourCoins; tests.MinimumCoinTests.GetCaseOfTwoCoins

[Killed] Linq method mutation (Count() to Sum())
MinimumCoin.cs:38:32
             int sum = y.Sum();
             if (sum == total && currentCount > y.Count())
             {
-                currentCount = y.Count();
+                currentCount = y.Sum();
             }
         }
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Killed] Negate expression
MinimumCoin.cs:46:13
 
     public int GetCount(int total)
     {
-        if (CoinSet.Contains(total))
+        if (!(CoinSet.Contains(total)))
         {
             return 1;
killedBy: tests.MinimumCoinTests.GetCaseOfFourCoins; tests.MinimumCoinTests.GetCaseOfTwoCoins

[Killed] Block removal mutation
MinimumCoin.cs:47:9
     public int GetCount(int total)
     {
         if (CoinSet.Contains(total))
-        {
-            return 1;
-        }
+        {}
         else if (CoinSet.Min() > total)
         {
killedBy: tests.MinimumCoinTests.GetTrivialCase

[Killed] Linq method mutation (Min() to Max())
MinimumCoin.cs:50:18
         {
             return 1;
         }
-        else if (CoinSet.Min() > total)
+        else if (CoinSet.Max() > total)
         {
             return 0;
killedBy: tests.MinimumCoinTests.GetCaseOfTwoCoins

[Killed] Negate expression
MinimumCoin.cs:50:18
         {
             return 1;
         }
-        else if (CoinSet.Min() > total)
+        else if (!(CoinSet.Min() > total))
         {
             return 0;
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfFourCoins; tests.MinimumCoinTests.GetCaseOfTwoCoins

[Survived] Block removal mutation
MinimumCoin.cs:51:9
             return 1;
         }
         else if (CoinSet.Min() > total)
-        {
-            return 0;
-        }
+        {}
         else
         {

[Killed] Equality mutation
MinimumCoin.cs:57:29
         else
         {
             List<int> repeatedList = new();
-            for (int i = 0; i < RepeatFactor; i++)
+            for (int i = 0; i > RepeatFactor; i++)
             {
                 foreach (int x in CoinSet)
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
MinimumCoin.cs:57:47
         else
         {
             List<int> repeatedList = new();
-            for (int i = 0; i < RepeatFactor; i++)
+            for (int i = 0; i < RepeatFactor; i--)
             {
                 foreach (int x in CoinSet)

[Killed] Statement mutation
MinimumCoin.cs:61:21
             {
                 foreach (int x in CoinSet)
                 {
-                    repeatedList.Add(x);
+                    ;
                 }
             }
killedBy: tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins; tests.MinimumCoinTests.GetCaseOfFourCoins
