[Killed] Equality mutation
MySearch.cs:7:25
 {
     public static bool LinearSearchIntegers(int[] arrayToSearch, int queryItem)
     {
-        for (int i = 0; i < arrayToSearch.Length; i++)
+        for (int i = 0; i > arrayToSearch.Length; i++)
         {
             if (arrayToSearch[i] == queryItem)
killedBy: tests.MySearchTests.LinearSearchTestDoesExist

[Killed] PostIncrementExpression to PostDecrementExpression mutation
MySearch.cs:7:51
 {
     public static bool LinearSearchIntegers(int[] arrayToSearch, int queryItem)
     {
-        for (int i = 0; i < arrayToSearch.Length; i++)
+        for (int i = 0; i < arrayToSearch.Length; i--)
         {
             if (arrayToSearch[i] == queryItem)
killedBy: tests.MySearchTests.LinearSearchTestDoesExist

[Killed] Equality mutation
MySearch.cs:9:17
     {
         for (int i = 0; i < arrayToSearch.Length; i++)
         {
-            if (arrayToSearch[i] == queryItem)
+            if (arrayToSearch[i] != queryItem)
             {
                 return true;
killedBy: tests.MySearchTests.LinearSearchTestDoesNotExist

[Survived] Statement mutation
MySearch.cs:20:9
     public static int BinarySearchIntegers(int[] arrayToSearch, int queryItem)
     {
         int[] inputArray = arrayToSearch;
-        Array.Sort(inputArray);
+        ;
         int lowerBound = 0;
         int upperBound = inputArray.Length - 1;

[Killed] Arithmetic mutation
MySearch.cs:22:26
         int[] inputArray = arrayToSearch;
         Array.Sort(inputArray);
         int lowerBound = 0;
-        int upperBound = inputArray.Length - 1;
+        int upperBound = inputArray.Length + 1;
         int midPoint;
         while (lowerBound <= upperBound)
killedBy: tests.MySearchTests.BinarySearchDoesExistOdd4Twice; tests.MySearchTests.BinarySearchDoesExist4Twice; tests.MySearchTests.BinarySearchDoesNotExistOdd

[Killed] Equality mutation
MySearch.cs:24:16
         int lowerBound = 0;
         int upperBound = inputArray.Length - 1;
         int midPoint;
-        while (lowerBound <= upperBound)
+        while (lowerBound > upperBound)
         {
             midPoint = (upperBound + lowerBound) / 2;
killedBy: tests.MySearchTests.BinarySearchDoesExistOdd4Twice; tests.MySearchTests.BinarySearchDoesExistOdd4; tests.MySearchTests.BinarySearchExistsKhan

[Killed] Negate expression
MySearch.cs:24:16
         int lowerBound = 0;
         int upperBound = inputArray.Length - 1;
         int midPoint;
-        while (lowerBound <= upperBound)
+        while (!(lowerBound <= upperBound))
         {
             midPoint = (upperBound + lowerBound) / 2;
killedBy: tests.MySearchTests.BinarySearchDoesExistOdd4Twice; tests.MySearchTests.BinarySearchDoesExistOdd4; tests.MySearchTests.BinarySearchExistsKhan

[Killed] Arithmetic mutation
MySearch.cs:26:24
         int midPoint;
         while (lowerBound <= upperBound)
         {
-            midPoint = (upperBound + lowerBound) / 2;
+            midPoint = (upperBound + lowerBound) * 2;
             if (inputArray[midPoint] == queryItem)
             {
killedBy: tests.MySearchTests.BinarySearchDoesExistOdd4Twice; tests.MySearchTests.BinarySearchDoesExistOdd4; tests.MySearchTests.BinarySearchExistsKhan

[Timeout] Arithmetic mutation
MySearch.cs:26:25
         int midPoint;
         while (lowerBound <= upperBound)
         {
-            midPoint = (upperBound + lowerBound) / 2;
+            midPoint = (upperBound - lowerBound) / 2;
             if (inputArray[midPoint] == queryItem)
             {

[Killed] Equality mutation
MySearch.cs:27:17
         while (lowerBound <= upperBound)
         {
             midPoint = (upperBound + lowerBound) / 2;
-            if (inputArray[midPoint] == queryItem)
+            if (inputArray[midPoint] != queryItem)
             {
                 return midPoint;
killedBy: tests.MySearchTests.BinarySearchDoesExistOdd3

[Timeout] Block removal mutation
MySearch.cs:28:13
         {
             midPoint = (upperBound + lowerBound) / 2;
             if (inputArray[midPoint] == queryItem)
-            {
-                return midPoint;
-            }
+            {}
             else if (inputArray[midPoint] < queryItem)
             {

[Killed] Equality mutation
MySearch.cs:31:22
             {
                 return midPoint;
             }
-            else if (inputArray[midPoint] < queryItem)
+            else if (inputArray[midPoint] > queryItem)
             {
                 lowerBound = midPoint + 1;
killedBy: tests.MySearchTests.BinarySearchDoesExistOdd3

[Killed] Negate expression
MySearch.cs:31:22
             {
                 return midPoint;
             }
-            else if (inputArray[midPoint] < queryItem)
+            else if (!(inputArray[midPoint] < queryItem))
             {
                 lowerBound = midPoint + 1;
killedBy: tests.MySearchTests.BinarySearchDoesExistOdd3

[Timeout] Arithmetic mutation
MySearch.cs:33:30
             }
             else if (inputArray[midPoint] < queryItem)
             {
-                lowerBound = midPoint + 1;
+                lowerBound = midPoint - 1;
             }
             else if (inputArray[midPoint] > queryItem)

[Timeout] Equality mutation
MySearch.cs:35:22
             {
                 lowerBound = midPoint + 1;
             }
-            else if (inputArray[midPoint] > queryItem)
+            else if (inputArray[midPoint] < queryItem)
             {
                 upperBound = midPoint - 1;

[Timeout] Negate expression
MySearch.cs:35:22
             {
                 lowerBound = midPoint + 1;
             }
-            else if (inputArray[midPoint] > queryItem)
+            else if (!(inputArray[midPoint] > queryItem))
             {
                 upperBound = midPoint - 1;

[Timeout] Arithmetic mutation
MySearch.cs:37:30
             }
             else if (inputArray[midPoint] > queryItem)
             {
-                upperBound = midPoint - 1;
+                upperBound = midPoint + 1;
             }
         }

[Killed] Equality mutation
MySearch.cs:50:16
         int lowerBound = 0;
         int upperBound = inputArray.Length - 1;
         int midPoint;
-        while (lowerBound <= upperBound)
+        while (lowerBound < upperBound)
         {
             midPoint = (upperBound + lowerBound) / 2;
killedBy: tests.MyReverseBinarySearchTests.BinarySearchExistsKhan; tests.MyReverseBinarySearchTests.BinarySearchDoesExistOdd3; tests.MyReverseBinarySearchTests.BinarySearchDoesExist4
