[Survived] Block removal mutation
Person.cs:8:5
     public string Name { get; }
     public string Password { get; }
     internal Person(string name, string password)
-    {
-        Name = name;
-        Password = password;
-    }
+    {}
 }
 
