[Killed] Negate expression
PersonFactory.cs:9:16
     private static readonly int MAXIMUM_PASSWORD_LENGTH = 128;
     public static Person Create(string name, string password)
     {
-        return CheckPasswordMeetsRequirements(password)
+        return !(CheckPasswordMeetsRequirements(password)
+)
             ? new Person(name, password)
killedBy: tests.PersonTests.ShortOrLongPasswordsFail; tests.PersonTests.ShortOrLongPasswordsFail

[Killed] Equality mutation
PersonFactory.cs:16:53
     public static bool CheckPasswordMeetsRequirements(string password)
     {
         int length = password.Length;
-        return length >= MINIMUM_PASSWORD_LENGTH && length <= MAXIMUM_PASSWORD_LENGTH;
+        return length >= MINIMUM_PASSWORD_LENGTH && length > MAXIMUM_PASSWORD_LENGTH;
     }
 }
killedBy: tests.PersonTests.CheckPasswordMeetsRequirements_Should_ReturnTrue_When_WeAreWithinLengthLimit; tests.PersonTests.CheckPasswordMeetsRequirements_Should_ReturnTrue_When_WeAreWithinLengthLimit; tests.PersonTests.CheckPasswordMeetsRequirements_Should_ReturnTrue_When_WeAreWithinLengthLimit

[Killed] Equality mutation
PersonFactory.cs:16:16
     public static bool CheckPasswordMeetsRequirements(string password)
     {
         int length = password.Length;
-        return length >= MINIMUM_PASSWORD_LENGTH && length <= MAXIMUM_PASSWORD_LENGTH;
+        return length > MINIMUM_PASSWORD_LENGTH && length <= MAXIMUM_PASSWORD_LENGTH;
     }
 }
killedBy: tests.PersonTests.CheckPasswordMeetsRequirements_Should_ReturnTrue_When_WeAreWithinLengthLimit
