[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Revocation.cs:11:16
     {
         using StreamReader reader = new(filename);
         List<string> result = new();
-        while (!reader.EndOfStream)
+        while (reader.EndOfStream)
         {
             string line = reader.ReadLine();
killedBy: tests.RevocationTests.ReadCsv_ShouldReturnTokens

[Killed] Statement mutation
Revocation.cs:15:13
         {
             string line = reader.ReadLine();
             string[] values = line.Split(',');
-            result.Add(values[0]);
+            ;
         }
         return result;
killedBy: tests.RevocationTests.ReadCsv_ShouldReturnTokens

[Survived] Block removal mutation
Revocation.cs:25:9
         List<string> source = ReadCsv(filename);
         IEnumerable<IEnumerable<string>> batches = source.Batch(size);
         foreach (IEnumerable<string> bat in batches)
-        {
-            int x = bat.ToList().Count;
-        }
+        {}
     }
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
Revocation.cs:38:13
 
         foreach (TSource item in source)
         {
-            bucket ??= new TSource[size];
+            bucket = new TSource[size];
 
             bucket[count++] = item;

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Revocation.cs:40:20
         {
             bucket ??= new TSource[size];
 
-            bucket[count++] = item;
+            bucket[count--] = item;
             if (count != size)
             {
killedBy: tests.RevocationTests.GetBatches

[Survived] Equality mutation
Revocation.cs:41:17
             bucket ??= new TSource[size];
 
             bucket[count++] = item;
-            if (count != size)
+            if (count == size)
             {
                 continue;

[Survived] Statement mutation
Revocation.cs:43:17
             bucket[count++] = item;
             if (count != size)
             {
-                continue;
+                ;
             }
 

[Survived] Statement mutation
Revocation.cs:46:13
                 continue;
             }
 
-            yield return bucket;
+            ;
 
             bucket = null;

[Survived] Logical mutation
Revocation.cs:52:13
             count = 0;
         }
 
-        if (bucket != null && count > 0)
+        if (bucket != null || count > 0)
         {
             yield return bucket.Take(count).ToArray();

[Survived] Equality mutation
Revocation.cs:52:13
             count = 0;
         }
 
-        if (bucket != null && count > 0)
+        if (bucket == null && count > 0)
         {
             yield return bucket.Take(count).ToArray();

[Survived] Statement mutation
Revocation.cs:54:13
 
         if (bucket != null && count > 0)
         {
-            yield return bucket.Take(count).ToArray();
+            ;
         }
     }

[Survived] Linq method mutation (Take() to Skip())
Revocation.cs:54:26
 
         if (bucket != null && count > 0)
         {
-            yield return bucket.Take(count).ToArray();
+            yield return bucket.Skip(count).ToArray();
         }
     }
