[Killed] Statement mutation
TwoSum.cs:8:9
     public static bool CheckExists(int[] a, int X)
     {
         List<int> myList = new();
-        myList.AddRange(a);
+        ;
         _ = myList.Remove(X / 2);
         return myList.Any(x => myList.Contains(X - x));
killedBy: tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen

[Killed] Arithmetic mutation
TwoSum.cs:9:27
     {
         List<int> myList = new();
         myList.AddRange(a);
-        _ = myList.Remove(X / 2);
+        _ = myList.Remove(X * 2);
         return myList.Any(x => myList.Contains(X - x));
     }
killedBy: tests.TwoSumTests.SumDoesNotExistInCheckExistsTen

[Killed] Arithmetic mutation
TwoSum.cs:10:48
         List<int> myList = new();
         myList.AddRange(a);
         _ = myList.Remove(X / 2);
-        return myList.Any(x => myList.Contains(X - x));
+        return myList.Any(x => myList.Contains(X + x));
     }
     public static bool CheckExistsHashed(int[] array, int target)
killedBy: tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen

[Killed] Linq method mutation (Any() to All())
TwoSum.cs:10:16
         List<int> myList = new();
         myList.AddRange(a);
         _ = myList.Remove(X / 2);
-        return myList.Any(x => myList.Contains(X - x));
+        return myList.All(x => myList.Contains(X - x));
     }
     public static bool CheckExistsHashed(int[] array, int target)
killedBy: tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen

[Killed] Negate expression
TwoSum.cs:17:17
         HashSet<int> mySet = new();
         foreach (int element in array)
         {
-            if (mySet.Contains(element))
+            if (!(mySet.Contains(element)))
             {
                 return true;
killedBy: tests.TwoSumTests.SumDoesNotExistInCheckExistsHashedTen; tests.TwoSumTests.SumDoesNotExistInCheckExistsHashedTen; tests.TwoSumTests.SumDoesNotExistInCheckExistsHashed

[Killed] Arithmetic mutation
TwoSum.cs:23:31
             }
             else
             {
-                _ = mySet.Add(target - element);
+                _ = mySet.Add(target + element);
             }
         }
killedBy: tests.TwoSumTests.SumExistsInCheckExistsHashed; tests.TwoSumTests.SumExistsInCheckExistsHashed; tests.TwoSumTests.SumExistsInCheckExistsHashed
