[Survived] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:66:16
             input /= 10;
         }
 
-        while (input / 10 > 0)
+        while (input / 10 < 0)
         {
             ListNode current2 = new()

[Timeout] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:66:16
             input /= 10;
         }
 
-        while (input / 10 > 0)
+        while (input / 10 >= 0)
         {
             ListNode current2 = new()
