[Killed] Equality mutation
src/mydotnet/hellolib/BubbleSort.cs:9:29
     {
         for (int i = 0; i < input.Length; i++)
         {
-            for (int j = 0; j < input.Length - 1; j++)
+            for (int j = 0; j > input.Length - 1; j++)
             {
                 if (input[j] > input[j + 1])
killedBy: tests.BubbleSortTests.SortThreeElementUnsortedArray

[Killed] Equality mutation
src/mydotnet/hellolib/BubbleSort.cs:11:21
         {
             for (int j = 0; j < input.Length - 1; j++)
             {
-                if (input[j] > input[j + 1])
+                if (input[j] < input[j + 1])
                 {
                     (input[j], input[j + 1]) = (input[j + 1], input[j]);
killedBy: tests.BubbleSortTests.SortThreeElementSortedArray; tests.BubbleSortTests.SortFourElementSortedArray; tests.BubbleSortTests.SortTwoElementSortedArray
