[Timeout] Equality mutation
src/mydotnet/hellolib/MergeSort.cs:7:13
 {
     public static void SortIntegers(int[] input)
     {
-        if (input.Length <= 1) return;
+        if (input.Length < 1) return;
         int leftSize = input.Length / 2;
         int rightSize = input.Length - leftSize;

[Killed] Negate expression
src/mydotnet/hellolib/MergeSort.cs:31:17
 
         while (remaining > 0)
         {
-            if (leftIndex >= left.Length)
+            if (!(leftIndex >= left.Length))
             {
                 input[targetIndex] = right[rightIndex++];
killedBy: tests.MergeSortTests.SortThreeElementSortedArray; tests.MergeSortTests.SortTwoElementSortedArray; tests.MergeSortTests.SortThreeElementUnsortedArray

[Killed] Equality mutation
src/mydotnet/hellolib/MergeSort.cs:36:22
                 input[targetIndex] = right[rightIndex++];
             }
 
-            else if (rightIndex >= right.Length)
+            else if (rightIndex < right.Length)
             {
                 input[targetIndex] = left[leftIndex++];
killedBy: tests.MergeSortTests.SortThreeElementUnsortedArray
