[Killed] Linq method mutation (Count() to Sum())
src/mydotnet/hellolib/MinimumCoin.cs:36:48
         foreach (IEnumerable<int> y in x)
         {
             int sum = y.Sum();
-            if (sum == total && currentCount > y.Count())
+            if (sum == total && currentCount > y.Sum())
             {
                 currentCount = y.Count();
killedBy: tests.MinimumCoinTests.GetCaseOfEightCoins

[Killed] Logical mutation
src/mydotnet/hellolib/MinimumCoin.cs:36:17
         foreach (IEnumerable<int> y in x)
         {
             int sum = y.Sum();
-            if (sum == total && currentCount > y.Count())
+            if (sum == total || currentCount > y.Count())
             {
                 currentCount = y.Count();
killedBy: tests.MinimumCoinTests.GetCaseOfFourCoins; tests.MinimumCoinTests.GetCaseOfTwoCoins; tests.MinimumCoinTests.GetFreqLabsTwoCoins

[Killed] Equality mutation
src/mydotnet/hellolib/MinimumCoin.cs:50:18
         {
             return 1;
         }
-        else if (CoinSet.Min() > total)
+        else if (CoinSet.Min() < total)
         {
             return 0;
killedBy: tests.MinimumCoinTests.GetCaseOfFourCoins; tests.MinimumCoinTests.GetCaseOfTwoCoins; tests.MinimumCoinTests.GetFreqLabsTwoCoins
