[Killed] Equality mutation
src/mydotnet/hellolib/MySearch.cs:7:25
 {
     public static bool LinearSearchIntegers(int[] arrayToSearch, int queryItem)
     {
-        for (int i = 0; i < arrayToSearch.Length; i++)
+        for (int i = 0; i <= arrayToSearch.Length; i++)
         {
             if (arrayToSearch[i] == queryItem)
killedBy: tests.MySearchTests.LinearSearchTestDoesNotExist

[Survived] Equality mutation
src/mydotnet/hellolib/MySearch.cs:35:22
             {
                 lowerBound = midPoint + 1;
             }
-            else if (inputArray[midPoint] > queryItem)
+            else if (inputArray[midPoint] >= queryItem)
             {
                 upperBound = midPoint - 1;

[Survived] Equality mutation
src/mydotnet/hellolib/MySearch.cs:61:22
             {
                 upperBound = midPoint - 1;
             }
-            else if (inputArray[midPoint] < queryItem)
+            else if (inputArray[midPoint] <= queryItem)
             {
                 lowerBound = midPoint + 1;
