[Killed] Equality mutation
src/mydotnet/hellolib/PersonFactory.cs:16:53
     public static bool CheckPasswordMeetsRequirements(string password)
     {
         int length = password.Length;
-        return length >= MINIMUM_PASSWORD_LENGTH && length <= MAXIMUM_PASSWORD_LENGTH;
+        return length >= MINIMUM_PASSWORD_LENGTH && length < MAXIMUM_PASSWORD_LENGTH;
     }
 }
killedBy: tests.PersonTests.CreatePersonWithName_ShouldSucceed_WhenPasswordMatchesMaximumLength; tests.PersonTests.CheckPasswordMeetsRequirements_Should_ReturnTrue_When_WeAreWithinLengthLimit
