[Survived] Equality mutation
src/mydotnet/hellolib/Revocation.cs:52:31
             count = 0;
         }
 
-        if (bucket != null && count > 0)
+        if (bucket != null && count < 0)
         {
             yield return bucket.Take(count).ToArray();
