[Killed] Negate expression
src/mydotnet/hellolib/AddTwoNumbers.cs:22:16
         ListNode p = l1, q = l2, current = dummyHead;
         int carry = 0;
 
-        while (p != null || q != null)
+        while (!(p != null || q != null))
         {
             int x = (p != null) ? p.val : 0;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Timeout] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:22:16
         ListNode p = l1, q = l2, current = dummyHead;
         int carry = 0;
 
-        while (p != null || q != null)
+        while (p == null || q != null)
         {
             int x = (p != null) ? p.val : 0;

[Killed] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:24:22
 
         while (p != null || q != null)
         {
-            int x = (p != null) ? p.val : 0;
+            int x = (p == null) ? p.val : 0;
             int y = (q != null) ? q.val : 0;
             int sum = carry + x + y;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Conditional (false) mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:24:21
 
         while (p != null || q != null)
         {
-            int x = (p != null) ? p.val : 0;
+            int x = (false?p.val :0);
             int y = (q != null) ? q.val : 0;
             int sum = carry + x + y;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:25:22
         while (p != null || q != null)
         {
             int x = (p != null) ? p.val : 0;
-            int y = (q != null) ? q.val : 0;
+            int y = (q == null) ? q.val : 0;
             int sum = carry + x + y;
             carry = sum / 10;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Conditional (false) mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:25:21
         while (p != null || q != null)
         {
             int x = (p != null) ? p.val : 0;
-            int y = (q != null) ? q.val : 0;
+            int y = (false?q.val :0);
             int sum = carry + x + y;
             carry = sum / 10;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Arithmetic mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:26:23
         {
             int x = (p != null) ? p.val : 0;
             int y = (q != null) ? q.val : 0;
-            int sum = carry + x + y;
+            int sum = carry + x - y;
             carry = sum / 10;
             current.next = new(sum % 10);
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Arithmetic mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:26:23
         {
             int x = (p != null) ? p.val : 0;
             int y = (q != null) ? q.val : 0;
-            int sum = carry + x + y;
+            int sum = carry - x + y;
             carry = sum / 10;
             current.next = new(sum % 10);
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Killed] Arithmetic mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:27:21
             int x = (p != null) ? p.val : 0;
             int y = (q != null) ? q.val : 0;
             int sum = carry + x + y;
-            carry = sum / 10;
+            carry = sum * 10;
             current.next = new(sum % 10);
             current = current.next;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreSingleDigitAndOne

[Killed] Arithmetic mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:28:32
             int y = (q != null) ? q.val : 0;
             int sum = carry + x + y;
             carry = sum / 10;
-            current.next = new(sum % 10);
+            current.next = new(sum * 10);
             current = current.next;
             if (p != null) p = p.next;
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreTwoDigits

[Timeout] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:30:17
             carry = sum / 10;
             current.next = new(sum % 10);
             current = current.next;
-            if (p != null) p = p.next;
+            if (p == null) p = p.next;
             if (q != null) q = q.next;
         }

[Timeout] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:31:17
             current.next = new(sum % 10);
             current = current.next;
             if (p != null) p = p.next;
-            if (q != null) q = q.next;
+            if (q == null) q = q.next;
         }
 

[Killed] Negate expression
src/mydotnet/hellolib/AddTwoNumbers.cs:34:13
             if (q != null) q = q.next;
         }
 
-        if (carry > 0)
+        if (!(carry > 0))
         {
             current.next = new(carry);
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreSingleDigitAndOne; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreSingleDigitAndZero

[Killed] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:34:13
             if (q != null) q = q.next;
         }
 
-        if (carry > 0)
+        if (carry >= 0)
         {
             current.next = new(carry);
killedBy: tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreSingleDigitAndOne; tests.AddTwoNumbersTests.AddTwoNumbers_ShouldReturnSumWhenBothInputsAreSingleDigitAndZero

[NoCoverage] Block removal mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:35:9
         }
 
         if (carry > 0)
-        {
-            current.next = new(carry);
-        }
+        {}
 
         return dummyHead.next;

[NoCoverage] Equality mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:47:16
         int number = 0;
         int multiplier = 1;
 
-        while (l != null)
+        while (l == null)
         {
             number += l.val * multiplier;

[NoCoverage] Arithmetic mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:49:23
 
         while (l != null)
         {
-            number += l.val * multiplier;
+            number += l.val / multiplier;
             multiplier *= 10;
             l = l.next;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:49:13
 
         while (l != null)
         {
-            number += l.val * multiplier;
+            number -= l.val * multiplier;
             multiplier *= 10;
             l = l.next;

[NoCoverage] MultiplyAssignmentExpression to DivideAssignmentExpression mutation
src/mydotnet/hellolib/AddTwoNumbers.cs:50:13
         while (l != null)
         {
             number += l.val * multiplier;
-            multiplier *= 10;
+            multiplier /= 10;
             l = l.next;
         }
