[Survived] Statement mutation
src/mydotnet/hellolib/BackoffException.cs:9:36
     {
         try
         {
-            await Task.Run(() => { throw new ApplicationException("just testing"); });
+            await Task.Run(() => { ; });
 
             return;

[Survived] Statement mutation
src/mydotnet/hellolib/BackoffException.cs:9:13
     {
         try
         {
-            await Task.Run(() => { throw new ApplicationException("just testing"); });
+            ;
 
             return;

[Survived] Statement mutation
src/mydotnet/hellolib/BackoffException.cs:15:13
         }
         catch (Exception ex)
         {
-            Console.WriteLine(ex.ToString());
+            ;
             int delay = 0;
 

[Timeout] Equality mutation
src/mydotnet/hellolib/BackoffException.cs:18:17
             Console.WriteLine(ex.ToString());
             int delay = 0;
 
-            if (stopAfter > 0)
+            if (stopAfter < 0)
             {
                 currentIteration++;

[Survived] Equality mutation
src/mydotnet/hellolib/BackoffException.cs:18:17
             Console.WriteLine(ex.ToString());
             int delay = 0;
 
-            if (stopAfter > 0)
+            if (stopAfter >= 0)
             {
                 currentIteration++;

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
src/mydotnet/hellolib/BackoffException.cs:20:17
 
             if (stopAfter > 0)
             {
-                currentIteration++;
+                currentIteration--;
             }
 

[Timeout] Statement mutation
src/mydotnet/hellolib/BackoffException.cs:20:17
 
             if (stopAfter > 0)
             {
-                currentIteration++;
+                ;
             }
 

[Survived] Equality mutation
src/mydotnet/hellolib/BackoffException.cs:23:20
                 currentIteration++;
             }
 
-            while (currentIteration < stopAfter || stopAfter == 0)
+            while (currentIteration > stopAfter || stopAfter == 0)
             {
                 try

[Timeout] Equality mutation
src/mydotnet/hellolib/BackoffException.cs:23:52
                 currentIteration++;
             }
 
-            while (currentIteration < stopAfter || stopAfter == 0)
+            while (currentIteration < stopAfter || stopAfter != 0)
             {
                 try

[Survived] Statement mutation
src/mydotnet/hellolib/BackoffException.cs:27:21
             {
                 try
                 {
-                    await BackoffSelfinflictedException(name, stopAfter, currentIteration);
+                    ;
                     return;
                 }

[Timeout] Statement mutation
src/mydotnet/hellolib/BackoffException.cs:28:21
                 try
                 {
                     await BackoffSelfinflictedException(name, stopAfter, currentIteration);
-                    return;
+                    ;
                 }
                 catch

[NoCoverage] Statement mutation
src/mydotnet/hellolib/BackoffException.cs:32:21
                 }
                 catch
                 {
-                    await Task.Delay(delay);
+                    ;
                     delay += 1000;
                     if (stopAfter > 0)

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
src/mydotnet/hellolib/BackoffException.cs:33:21
                 catch
                 {
                     await Task.Delay(delay);
-                    delay += 1000;
+                    delay -= 1000;
                     if (stopAfter > 0)
                     {

[NoCoverage] Negate expression
src/mydotnet/hellolib/BackoffException.cs:34:25
                 {
                     await Task.Delay(delay);
                     delay += 1000;
-                    if (stopAfter > 0)
+                    if (!(stopAfter > 0))
                     {
                         currentIteration++;

[NoCoverage] Equality mutation
src/mydotnet/hellolib/BackoffException.cs:34:25
                 {
                     await Task.Delay(delay);
                     delay += 1000;
-                    if (stopAfter > 0)
+                    if (stopAfter >= 0)
                     {
                         currentIteration++;

[NoCoverage] Equality mutation
src/mydotnet/hellolib/BackoffException.cs:38:25
                     {
                         currentIteration++;
                     }
-                    if (stopAfter > 0 && currentIteration >= stopAfter)
+                    if (stopAfter < 0 && currentIteration >= stopAfter)
                     {
                         break;

[NoCoverage] Logical mutation
src/mydotnet/hellolib/BackoffException.cs:38:25
                     {
                         currentIteration++;
                     }
-                    if (stopAfter > 0 && currentIteration >= stopAfter)
+                    if (stopAfter > 0 || currentIteration >= stopAfter)
                     {
                         break;
