[Killed] Equality mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:7:29
 {
     public int FindClosestNumber(int[] nums)
     {
-        if (nums == null || nums.Length == 0)
+        if (nums == null || nums.Length != 0)
         {
             logger.LogWarning("Input array is null or empty.");
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturnNegative100000; tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[Killed] Negate expression
src/mydotnet/hellolib/FindClosestNumberToZero.cs:7:13
 {
     public int FindClosestNumber(int[] nums)
     {
-        if (nums == null || nums.Length == 0)
+        if (!(nums == null || nums.Length == 0))
         {
             logger.LogWarning("Input array is null or empty.");
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturnNegative100000; tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[NoCoverage] Statement mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:9:13
     {
         if (nums == null || nums.Length == 0)
         {
-            logger.LogWarning("Input array is null or empty.");
+            ;
             return 0;
         }

[Killed] Equality mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:13:13
             return 0;
         }
 
-        if (nums.Length == 1)
+        if (nums.Length != 1)
         {
             logger.LogInformation("Single element array, returning the only element.");
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[NoCoverage] Statement mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:15:13
 
         if (nums.Length == 1)
         {
-            logger.LogInformation("Single element array, returning the only element.");
+            ;
             return nums[0];
         }

[NoCoverage] String mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:15:35
 
         if (nums.Length == 1)
         {
-            logger.LogInformation("Single element array, returning the only element.");
+            logger.LogInformation("");
             return nums[0];
         }

[Killed] PostIncrementExpression to PostDecrementExpression mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:20:42
         }
 
         int[] abs = new int[nums.Length];
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i < nums.Length; i--)
         {
             abs[i] = Math.Abs(nums[i]);
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturnNegative100000; tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[Killed] Equality mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:20:25
         }
 
         int[] abs = new int[nums.Length];
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i > nums.Length; i++)
         {
             abs[i] = Math.Abs(nums[i]);
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturnNegative100000; tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[Killed] Block removal mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:21:9
 
         int[] abs = new int[nums.Length];
         for (int i = 0; i < nums.Length; i++)
-        {
-            abs[i] = Math.Abs(nums[i]);
-        }
+        {}
 
         Array.Sort(abs);
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturnNegative100000; tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[Killed] Statement mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:25:9
             abs[i] = Math.Abs(nums[i]);
         }
 
-        Array.Sort(abs);
+        ;
 
         int closestNumber = nums.Contains(abs[0]) ? abs[0] : -abs[0];
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:27:62
 
         Array.Sort(abs);
 
-        int closestNumber = nums.Contains(abs[0]) ? abs[0] : -abs[0];
+        int closestNumber = nums.Contains(abs[0]) ? abs[0] : +abs[0];
         logger.LogInformation("Closest number to zero found: {closestNumber}", closestNumber);
 
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturnNegative100000

[Killed] Conditional (false) mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:27:29
 
         Array.Sort(abs);
 
-        int closestNumber = nums.Contains(abs[0]) ? abs[0] : -abs[0];
+        int closestNumber = (false?abs[0] :-abs[0]);
         logger.LogInformation("Closest number to zero found: {closestNumber}", closestNumber);
 
killedBy: tests.FindClosestNumberToZeroTests.FindClosestNumber_ShouldReturn1

[Survived] Statement mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:28:9
         Array.Sort(abs);
 
         int closestNumber = nums.Contains(abs[0]) ? abs[0] : -abs[0];
-        logger.LogInformation("Closest number to zero found: {closestNumber}", closestNumber);
+        ;
 
         return closestNumber;

[Survived] String mutation
src/mydotnet/hellolib/FindClosestNumberToZero.cs:28:31
         Array.Sort(abs);
 
         int closestNumber = nums.Contains(abs[0]) ? abs[0] : -abs[0];
-        logger.LogInformation("Closest number to zero found: {closestNumber}", closestNumber);
+        logger.LogInformation("", closestNumber);
 
         return closestNumber;
