[Killed] Arithmetic mutation
src/mydotnet/hellolib/MergeSortedArray.cs:7:17
 {
     public void Merge(int[] nums1, int m, int[] nums2, int n)
     {
-        int i = m - 1;
+        int i = m + 1;
         int j = n - 1;
         int k = m + n - 1;
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus

[Killed] Arithmetic mutation
src/mydotnet/hellolib/MergeSortedArray.cs:8:17
     public void Merge(int[] nums1, int m, int[] nums2, int n)
     {
         int i = m - 1;
-        int j = n - 1;
+        int j = n + 1;
         int k = m + n - 1;
 
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus

[Killed] Arithmetic mutation
src/mydotnet/hellolib/MergeSortedArray.cs:9:17
     {
         int i = m - 1;
         int j = n - 1;
-        int k = m + n - 1;
+        int k = m + n + 1;
 
         // Merge in reverse order
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus

[Killed] Arithmetic mutation
src/mydotnet/hellolib/MergeSortedArray.cs:9:17
     {
         int i = m - 1;
         int j = n - 1;
-        int k = m + n - 1;
+        int k = m - n - 1;
 
         // Merge in reverse order
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus

[Killed] Logical mutation
src/mydotnet/hellolib/MergeSortedArray.cs:12:16
         int k = m + n - 1;
 
         // Merge in reverse order
-        while (i >= 0 && j >= 0)
+        while (i >= 0 || j >= 0)
         {
             if (nums1[i] > nums2[j])
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus

[Killed] Equality mutation
src/mydotnet/hellolib/MergeSortedArray.cs:12:16
         int k = m + n - 1;
 
         // Merge in reverse order
-        while (i >= 0 && j >= 0)
+        while (i < 0 && j >= 0)
         {
             if (nums1[i] > nums2[j])
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3

[Survived] Equality mutation
src/mydotnet/hellolib/MergeSortedArray.cs:14:17
         // Merge in reverse order
         while (i >= 0 && j >= 0)
         {
-            if (nums1[i] > nums2[j])
+            if (nums1[i] < nums2[j])
             {
                 nums1[k] = nums1[i];

[Survived] Negate expression
src/mydotnet/hellolib/MergeSortedArray.cs:14:17
         // Merge in reverse order
         while (i >= 0 && j >= 0)
         {
-            if (nums1[i] > nums2[j])
+            if (!(nums1[i] > nums2[j]))
             {
                 nums1[k] = nums1[i];

[Killed] Statement mutation
src/mydotnet/hellolib/MergeSortedArray.cs:17:17
             if (nums1[i] > nums2[j])
             {
                 nums1[k] = nums1[i];
-                i--;
+                ;
             }
             else
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn_kus; tests.MergeSortedArrayTests.Merge_ShouldReturn1

[Killed] PostDecrementExpression to PostIncrementExpression mutation
src/mydotnet/hellolib/MergeSortedArray.cs:17:17
             if (nums1[i] > nums2[j])
             {
                 nums1[k] = nums1[i];
-                i--;
+                i++;
             }
             else
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn_kus; tests.MergeSortedArrayTests.Merge_ShouldReturn1

[Killed] PostDecrementExpression to PostIncrementExpression mutation
src/mydotnet/hellolib/MergeSortedArray.cs:22:17
             else
             {
                 nums1[k] = nums2[j];
-                j--;
+                j++;
             }
             k--;
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus; tests.MergeSortedArrayTests.Merge_ShouldReturn1

[Killed] Statement mutation
src/mydotnet/hellolib/MergeSortedArray.cs:22:17
             else
             {
                 nums1[k] = nums2[j];
-                j--;
+                ;
             }
             k--;
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus; tests.MergeSortedArrayTests.Merge_ShouldReturn1

[Killed] PostDecrementExpression to PostIncrementExpression mutation
src/mydotnet/hellolib/MergeSortedArray.cs:24:13
                 nums1[k] = nums2[j];
                 j--;
             }
-            k--;
+            k++;
         }
 
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus; tests.MergeSortedArrayTests.Merge_ShouldReturn1

[Killed] Statement mutation
src/mydotnet/hellolib/MergeSortedArray.cs:24:13
                 nums1[k] = nums2[j];
                 j--;
             }
-            k--;
+            ;
         }
 
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus; tests.MergeSortedArrayTests.Merge_ShouldReturn1

[Killed] Equality mutation
src/mydotnet/hellolib/MergeSortedArray.cs:28:16
         }
 
         // If there are remaining elements in nums2, copy them
-        while (j >= 0)
+        while (j < 0)
         {
             nums1[k] = nums2[j];
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus

[Killed] Negate expression
src/mydotnet/hellolib/MergeSortedArray.cs:28:16
         }
 
         // If there are remaining elements in nums2, copy them
-        while (j >= 0)
+        while (!(j >= 0))
         {
             nums1[k] = nums2[j];
killedBy: tests.MergeSortedArrayTests.Merge_ShouldReturn3; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus1; tests.MergeSortedArrayTests.Merge_ShouldReturn_kus

[Survived] PostDecrementExpression to PostIncrementExpression mutation
src/mydotnet/hellolib/MergeSortedArray.cs:32:13
         {
             nums1[k] = nums2[j];
             j--;
-            k--;
+            k++;
         }
 

[Survived] Statement mutation
src/mydotnet/hellolib/MergeSortedArray.cs:32:13
         {
             nums1[k] = nums2[j];
             j--;
-            k--;
+            ;
         }
 

[Survived] Statement mutation
src/mydotnet/hellolib/MergeSortedArray.cs:36:9
         }
 
         // No need to copy the remaining elements of nums1, as they are already in place
-        logger.LogInformation("Executed {method} for inputs of size {m} and {n}", nameof(Merge), m, n);
+        ;
     }
 }
