[Killed] Linq method mutation (Min() to Max())
src/mydotnet/hellolib/MergeStringsAlternately.cs:12:25
         StringBuilder result = new();
         int length1 = word1.Length;
         int length2 = word2.Length;
-        int minLength = Math.Min(length1, length2);
+        int minLength = Math.Max(length1, length2);
 
         // Merge characters from both strings
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[Killed] Equality mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:15:25
         int minLength = Math.Min(length1, length2);
 
         // Merge characters from both strings
-        for (int i = 0; i < minLength; i++)
+        for (int i = 0; i <= minLength; i++)
         {
             result.Append(word1[i]);
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[Killed] Equality mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:15:25
         int minLength = Math.Min(length1, length2);
 
         // Merge characters from both strings
-        for (int i = 0; i < minLength; i++)
+        for (int i = 0; i > minLength; i++)
         {
             result.Append(word1[i]);
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[Killed] Statement mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:17:13
         // Merge characters from both strings
         for (int i = 0; i < minLength; i++)
         {
-            result.Append(word1[i]);
+            ;
             result.Append(word2[i]);
         }
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[Killed] Statement mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:18:13
         for (int i = 0; i < minLength; i++)
         {
             result.Append(word1[i]);
-            result.Append(word2[i]);
+            ;
         }
 
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[Killed] Equality mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:22:13
         }
 
         // Append remaining characters from the longer string
-        if (length1 > minLength)
+        if (length1 < minLength)
         {
             result.Append(word1.AsSpan(minLength));
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[Killed] Negate expression
src/mydotnet/hellolib/MergeStringsAlternately.cs:22:13
         }
 
         // Append remaining characters from the longer string
-        if (length1 > minLength)
+        if (!(length1 > minLength))
         {
             result.Append(word1.AsSpan(minLength));
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[Killed] Statement mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:24:13
         // Append remaining characters from the longer string
         if (length1 > minLength)
         {
-            result.Append(word1.AsSpan(minLength));
+            ;
         }
         else if (length2 > minLength)
killedBy: tests.MergeStringsAlternatelyTests.MergeAlternately_ShouldReturn1

[NoCoverage] Equality mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:26:18
         {
             result.Append(word1.AsSpan(minLength));
         }
-        else if (length2 > minLength)
+        else if (length2 < minLength)
         {
             result.Append(word2.AsSpan(minLength));

[NoCoverage] Negate expression
src/mydotnet/hellolib/MergeStringsAlternately.cs:26:18
         {
             result.Append(word1.AsSpan(minLength));
         }
-        else if (length2 > minLength)
+        else if (!(length2 > minLength))
         {
             result.Append(word2.AsSpan(minLength));

[NoCoverage] Statement mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:28:13
         }
         else if (length2 > minLength)
         {
-            result.Append(word2.AsSpan(minLength));
+            ;
         }
         logger.LogInformation("Executed {method} for inputs of size {m} and {n}", nameof(MergeAlternately), word1.Length, word2.Length);

[Survived] Statement mutation
src/mydotnet/hellolib/MergeStringsAlternately.cs:30:9
         {
             result.Append(word2.AsSpan(minLength));
         }
-        logger.LogInformation("Executed {method} for inputs of size {m} and {n}", nameof(MergeAlternately), word1.Length, word2.Length);
+        ;
         return result.ToString();
     }
