[Killed] Negate expression
src/mydotnet/hellolib/MinimumCoin.cs:30:17
         foreach (IEnumerable<int> y in x)
         {
             int sum = y.Sum();
-            if (sum == total && currentCount > y.Count())
+            if (!(sum == total && currentCount > y.Count()))
             {
                 currentCount = y.Count();
killedBy: tests.MinimumCoinTests.GetCount_ShouldReturnCorrectCount; tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfFourCoins

[Killed] Equality mutation
src/mydotnet/hellolib/MinimumCoin.cs:51:29
         else
         {
             List<int> repeatedList = [];
-            for (int i = 0; i < RepeatFactor; i++)
+            for (int i = 0; i > RepeatFactor; i++)
             {
                 foreach (int x in CoinSet)
killedBy: tests.MinimumCoinTests.GetCount_ShouldReturnCorrectCount; tests.MinimumCoinTests.GetFreqLabsTwoCoins; tests.MinimumCoinTests.GetCaseOfEightCoins

[Timeout] Equality mutation
src/mydotnet/hellolib/MinimumCoin.cs:51:29
         else
         {
             List<int> repeatedList = [];
-            for (int i = 0; i < RepeatFactor; i++)
+            for (int i = 0; i <= RepeatFactor; i++)
             {
                 foreach (int x in CoinSet)
