[Killed] Negate expression
src/mydotnet/hellolib/MyCleaner.cs:7:13
 {
     public async Task<string> CleanUrlAsync(string url)
     {
-        if (string.IsNullOrWhiteSpace(url))
+        if (!(string.IsNullOrWhiteSpace(url)))
         {
             return "";
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] String mutation
src/mydotnet/hellolib/MyCleaner.cs:7:13
 {
     public async Task<string> CleanUrlAsync(string url)
     {
-        if (string.IsNullOrWhiteSpace(url))
+        if ((url!=""))
         {
             return "";
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] String mutation
src/mydotnet/hellolib/MyCleaner.cs:9:20
     {
         if (string.IsNullOrWhiteSpace(url))
         {
-            return "";
+            return "Stryker was here!";
         }
         string extractedUrl = ExtractFromAddress(url);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnEmptyStringForEmptyInput; tests.MyCleanerTests.CleanUrl_ShouldReturnEmptyStringForEmptyInput

[Killed] Equality mutation
src/mydotnet/hellolib/MyCleaner.cs:12:13
             return "";
         }
         string extractedUrl = ExtractFromAddress(url);
-        if (extractedUrl != url)
+        if (extractedUrl == url)
         {
             return RemoveQueryParameters(extractedUrl);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:13:9
         }
         string extractedUrl = ExtractFromAddress(url);
         if (extractedUrl != url)
-        {
-            return RemoveQueryParameters(extractedUrl);
-        }
+        {}
         try
         {
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Negate expression
src/mydotnet/hellolib/MyCleaner.cs:20:17
         {
             string finalRedirectUrl = await FollowRedirectsAsync(url);
 
-            if (finalRedirectUrl.Contains("amazon.com"))
+            if (!(finalRedirectUrl.Contains("amazon.com")))
             {
                 finalRedirectUrl = RemoveAmazonExtraPathSegments(finalRedirectUrl);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:21:13
             string finalRedirectUrl = await FollowRedirectsAsync(url);
 
             if (finalRedirectUrl.Contains("amazon.com"))
-            {
-                finalRedirectUrl = RemoveAmazonExtraPathSegments(finalRedirectUrl);
-            }
+            {}
 
             return RemoveQueryParameters(finalRedirectUrl);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[NoCoverage] Statement mutation
src/mydotnet/hellolib/MyCleaner.cs:29:13
         }
         catch (Exception ex)
         {
-            logger.LogError(ex, "Error processing URL: {Url}", url);
+            ;
             return null;
         }

[Killed] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:35:5
     }
 
     private static string RemoveQueryParameters(string url)
-    {
-        Uri uri = new(url);
-        return uri.GetLeftPart(UriPartial.Path);
-    }
+    {}
 
     private async Task<string> FollowRedirectsAsync(string url)
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Equality mutation
src/mydotnet/hellolib/MyCleaner.cs:43:77
     private async Task<string> FollowRedirectsAsync(string url)
     {
         HttpResponseMessage response = await httpClient.GetAsync(url);
-        while (response.StatusCode == System.Net.HttpStatusCode.Redirect || response.StatusCode == System.Net.HttpStatusCode.MovedPermanently)
+        while (response.StatusCode == System.Net.HttpStatusCode.Redirect || response.StatusCode != System.Net.HttpStatusCode.MovedPermanently)
         {
             string redirectUrl = response.Headers.Location.ToString();
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Logical mutation
src/mydotnet/hellolib/MyCleaner.cs:43:16
     private async Task<string> FollowRedirectsAsync(string url)
     {
         HttpResponseMessage response = await httpClient.GetAsync(url);
-        while (response.StatusCode == System.Net.HttpStatusCode.Redirect || response.StatusCode == System.Net.HttpStatusCode.MovedPermanently)
+        while (response.StatusCode == System.Net.HttpStatusCode.Redirect && response.StatusCode == System.Net.HttpStatusCode.MovedPermanently)
         {
             string redirectUrl = response.Headers.Location.ToString();
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
src/mydotnet/hellolib/MyCleaner.cs:46:17
         while (response.StatusCode == System.Net.HttpStatusCode.Redirect || response.StatusCode == System.Net.HttpStatusCode.MovedPermanently)
         {
             string redirectUrl = response.Headers.Location.ToString();
-            if (!Uri.IsWellFormedUriString(redirectUrl, UriKind.Absolute))
+            if (Uri.IsWellFormedUriString(redirectUrl, UriKind.Absolute))
             {
                 Uri baseUri = new(url);

[NoCoverage] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:47:13
         {
             string redirectUrl = response.Headers.Location.ToString();
             if (!Uri.IsWellFormedUriString(redirectUrl, UriKind.Absolute))
-            {
-                Uri baseUri = new(url);
-                redirectUrl = new Uri(baseUri, redirectUrl).ToString();
-            }
+            {}
             try
             {

[Timeout] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:52:13
                 redirectUrl = new Uri(baseUri, redirectUrl).ToString();
             }
             try
-            {
-                response = await httpClient.GetAsync(redirectUrl);
-            }
+            {}
             catch (Exception e)
             {

[Survived] Statement mutation
src/mydotnet/hellolib/MyCleaner.cs:57:17
             }
             catch (Exception e)
             {
-                logger.LogError(e, "Exception in method {Method}", nameof(FollowRedirectsAsync));
+                ;
                 return ExtractFromAddress(redirectUrl);
             }

[Killed] String mutation
src/mydotnet/hellolib/MyCleaner.cs:69:41
         Uri uri = new(url);
         System.Collections.Specialized.NameValueCollection queryParams = HttpUtility.ParseQueryString(uri.Query);
 
-        string uParam = queryParams.Get("u");
+        string uParam = queryParams.Get("");
         if (uParam != null)
         {
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Equality mutation
src/mydotnet/hellolib/MyCleaner.cs:70:13
         System.Collections.Specialized.NameValueCollection queryParams = HttpUtility.ParseQueryString(uri.Query);
 
         string uParam = queryParams.Get("u");
-        if (uParam != null)
+        if (uParam == null)
         {
             return HttpUtility.UrlDecode(uParam);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:71:9
 
         string uParam = queryParams.Get("u");
         if (uParam != null)
-        {
-            return HttpUtility.UrlDecode(uParam);
-        }
+        {}
 
         string urlParam = queryParams.Get("url");
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Equality mutation
src/mydotnet/hellolib/MyCleaner.cs:76:13
         }
 
         string urlParam = queryParams.Get("url");
-        if (urlParam != null)
+        if (urlParam == null)
         {
             return HttpUtility.UrlDecode(urlParam);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:77:9
 
         string urlParam = queryParams.Get("url");
         if (urlParam != null)
-        {
-            return HttpUtility.UrlDecode(urlParam);
-        }
+        {}
 
         string returnUrl = queryParams.Get("return");
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Equality mutation
src/mydotnet/hellolib/MyCleaner.cs:82:13
         }
 
         string returnUrl = queryParams.Get("return");
-        if (returnUrl != null)
+        if (returnUrl == null)
         {
             string decodedUrl = HttpUtility.UrlDecode(returnUrl);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput; tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Equality mutation
src/mydotnet/hellolib/MyCleaner.cs:86:17
         {
             string decodedUrl = HttpUtility.UrlDecode(returnUrl);
             string finalUrl = HttpUtility.ParseQueryString(new Uri(decodedUrl).Query).Get("u");
-            if (finalUrl != null)
+            if (finalUrl == null)
             {
                 return HttpUtility.UrlDecode(finalUrl);
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Block removal mutation
src/mydotnet/hellolib/MyCleaner.cs:87:13
             string decodedUrl = HttpUtility.UrlDecode(returnUrl);
             string finalUrl = HttpUtility.ParseQueryString(new Uri(decodedUrl).Query).Get("u");
             if (finalUrl != null)
-            {
-                return HttpUtility.UrlDecode(finalUrl);
-            }
+            {}
         }
 
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Negate expression
src/mydotnet/hellolib/MyCleaner.cs:99:13
     {
         Uri uri = new(url);
         string[] segments = uri.Segments;
-        if (segments.Length > 3 && segments[1].TrimEnd('/') == "gp" && segments[2].TrimEnd('/') == "product")
+        if (!(segments.Length > 3 && segments[1].TrimEnd('/') == "gp" && segments[2].TrimEnd('/') == "product"))
         {
             return $"{uri.Scheme}://{uri.Host}{segments[0]}{segments[1]}{segments[2]}{segments[3]}";
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput

[Killed] Equality mutation
src/mydotnet/hellolib/MyCleaner.cs:99:13
     {
         Uri uri = new(url);
         string[] segments = uri.Segments;
-        if (segments.Length > 3 && segments[1].TrimEnd('/') == "gp" && segments[2].TrimEnd('/') == "product")
+        if (segments.Length < 3 && segments[1].TrimEnd('/') == "gp" && segments[2].TrimEnd('/') == "product")
         {
             return $"{uri.Scheme}://{uri.Host}{segments[0]}{segments[1]}{segments[2]}{segments[3]}";
killedBy: tests.MyCleanerTests.CleanUrl_ShouldReturnValidOutput
