[Killed] Equality mutation
src/mydotnet/hellolib/PascalTriangle.cs:9:25
     {
         List<List<int>> triangle = [];
 
-        for (int i = 0; i < rows; i++)
+        for (int i = 0; i <= rows; i++)
         {
             List<int> row = [1];
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithZeroRows_ReturnsEmptyList; tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle; tests.PascalsTriangleTests.GeneratePascalsTriangle_WithOneRow_ReturnsCorrectTriangle

[Killed] Equality mutation
src/mydotnet/hellolib/PascalTriangle.cs:9:25
     {
         List<List<int>> triangle = [];
 
-        for (int i = 0; i < rows; i++)
+        for (int i = 0; i > rows; i++)
         {
             List<int> row = [1];
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle; tests.PascalsTriangleTests.GeneratePascalsTriangle_WithOneRow_ReturnsCorrectTriangle

[Killed] Equality mutation
src/mydotnet/hellolib/PascalTriangle.cs:13:29
         {
             List<int> row = [1];
 
-            for (int j = 1; j < i; j++)
+            for (int j = 1; j <= i; j++)
             {
                 row.Add(triangle[i - 1][j - 1] + triangle[i - 1][j]);
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle

[Killed] Equality mutation
src/mydotnet/hellolib/PascalTriangle.cs:13:29
         {
             List<int> row = [1];
 
-            for (int j = 1; j < i; j++)
+            for (int j = 1; j > i; j++)
             {
                 row.Add(triangle[i - 1][j - 1] + triangle[i - 1][j]);
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle; tests.PascalsTriangleTests.GeneratePascalsTriangle_WithOneRow_ReturnsCorrectTriangle

[Killed] Arithmetic mutation
src/mydotnet/hellolib/PascalTriangle.cs:15:59
 
             for (int j = 1; j < i; j++)
             {
-                row.Add(triangle[i - 1][j - 1] + triangle[i - 1][j]);
+                row.Add(triangle[i - 1][j - 1] + triangle[i + 1][j]);
             }
 
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle

[Killed] Statement mutation
src/mydotnet/hellolib/PascalTriangle.cs:15:17
 
             for (int j = 1; j < i; j++)
             {
-                row.Add(triangle[i - 1][j - 1] + triangle[i - 1][j]);
+                ;
             }
 
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle

[Killed] Equality mutation
src/mydotnet/hellolib/PascalTriangle.cs:18:17
                 row.Add(triangle[i - 1][j - 1] + triangle[i - 1][j]);
             }
 
-            if (i > 0)
+            if (i < 0)
             {
                 row.Add(1);
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle

[Killed] Negate expression
src/mydotnet/hellolib/PascalTriangle.cs:18:17
                 row.Add(triangle[i - 1][j - 1] + triangle[i - 1][j]);
             }
 
-            if (i > 0)
+            if (!(i > 0))
             {
                 row.Add(1);
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle; tests.PascalsTriangleTests.GeneratePascalsTriangle_WithOneRow_ReturnsCorrectTriangle

[Killed] Statement mutation
src/mydotnet/hellolib/PascalTriangle.cs:20:17
 
             if (i > 0)
             {
-                row.Add(1);
+                ;
             }
 
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle

[Killed] Statement mutation
src/mydotnet/hellolib/PascalTriangle.cs:23:13
                 row.Add(1);
             }
 
-            triangle.Add(row);
+            ;
         }
 
killedBy: tests.PascalsTriangleTests.GeneratePascalsTriangle_WithFiveRows_ReturnsCorrectTriangle; tests.PascalsTriangleTests.GeneratePascalsTriangle_WithOneRow_ReturnsCorrectTriangle
