[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/mydotnet/hellolib/Revocation.cs:11:16
     {
         using StreamReader reader = new(filename);
         List<string> result = [];
-        while (!reader.EndOfStream)
+        while (reader.EndOfStream)
         {
             string line = reader.ReadLine();
killedBy: tests.RevocationTests.ReadCsv_ShouldReturnTokens
