[NoCoverage] Equality mutation
src/mydotnet/hellolib/TwoSum.cs:7:25
 {
     public static int[] GetTwoSumNaive(int[] nums, int target)
     {
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i > nums.Length; i++)
         {
             for (int j = 0; j < nums.Length; j++)

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
src/mydotnet/hellolib/TwoSum.cs:7:42
 {
     public static int[] GetTwoSumNaive(int[] nums, int target)
     {
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i < nums.Length; i--)
         {
             for (int j = 0; j < nums.Length; j++)

[NoCoverage] Equality mutation
src/mydotnet/hellolib/TwoSum.cs:9:29
     {
         for (int i = 0; i < nums.Length; i++)
         {
-            for (int j = 0; j < nums.Length; j++)
+            for (int j = 0; j > nums.Length; j++)
             {
                 if (i != j && nums[i] + nums[j] == target)

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
src/mydotnet/hellolib/TwoSum.cs:9:46
     {
         for (int i = 0; i < nums.Length; i++)
         {
-            for (int j = 0; j < nums.Length; j++)
+            for (int j = 0; j < nums.Length; j--)
             {
                 if (i != j && nums[i] + nums[j] == target)

[NoCoverage] Equality mutation
src/mydotnet/hellolib/TwoSum.cs:11:31
         {
             for (int j = 0; j < nums.Length; j++)
             {
-                if (i != j && nums[i] + nums[j] == target)
+                if (i != j && nums[i] + nums[j] != target)
                 {
                     return [i, j];

[NoCoverage] Negate expression
src/mydotnet/hellolib/TwoSum.cs:11:21
         {
             for (int j = 0; j < nums.Length; j++)
             {
-                if (i != j && nums[i] + nums[j] == target)
+                if (!(i != j && nums[i] + nums[j] == target))
                 {
                     return [i, j];

[NoCoverage] Block removal mutation
src/mydotnet/hellolib/TwoSum.cs:12:17
             for (int j = 0; j < nums.Length; j++)
             {
                 if (i != j && nums[i] + nums[j] == target)
-                {
-                    return [i, j];
-                }
+                {}
             }
         }

[NoCoverage] Equality mutation
src/mydotnet/hellolib/TwoSum.cs:23:25
     public static int[] GetTwoSumOptimized(int[] nums, int target)
     {
         Dictionary<int, int> map = [];
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i <= nums.Length; i++)
         {
             int complement = target - nums[i];

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
src/mydotnet/hellolib/TwoSum.cs:23:42
     public static int[] GetTwoSumOptimized(int[] nums, int target)
     {
         Dictionary<int, int> map = [];
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i < nums.Length; i--)
         {
             int complement = target - nums[i];

[NoCoverage] Arithmetic mutation
src/mydotnet/hellolib/TwoSum.cs:25:30
         Dictionary<int, int> map = [];
         for (int i = 0; i < nums.Length; i++)
         {
-            int complement = target - nums[i];
+            int complement = target + nums[i];
             if (map.TryGetValue(complement, out int value))
             {

[NoCoverage] Negate expression
src/mydotnet/hellolib/TwoSum.cs:26:17
         for (int i = 0; i < nums.Length; i++)
         {
             int complement = target - nums[i];
-            if (map.TryGetValue(complement, out int value))
+            if (!(map.TryGetValue(complement, out int value)))
             {
                 return [value, i];

[NoCoverage] Block removal mutation
src/mydotnet/hellolib/TwoSum.cs:27:13
         {
             int complement = target - nums[i];
             if (map.TryGetValue(complement, out int value))
-            {
-                return [value, i];
-            }
+            {}
             map[nums[i]] = i;
         }

[Killed] PostIncrementExpression to PostDecrementExpression mutation
src/mydotnet/hellolib/TwoSum.cs:38:43
     public static bool CheckExists(int[] a, int X)
     {
         List<int> myList = [.. a];
-        for (int i = 0; i < myList.Count; i++)
+        for (int i = 0; i < myList.Count; i--)
         {
             for (int j = i + 1; j < myList.Count; j++)
killedBy: tests.TwoSumTests.SumDoesNotExistInCheckExistsTen; tests.TwoSumTests.SumDoesNotExistInCheckExistsTen; tests.TwoSumTests.SumDoesNotExistInCheckExists

[Survived] Equality mutation
src/mydotnet/hellolib/TwoSum.cs:38:25
     public static bool CheckExists(int[] a, int X)
     {
         List<int> myList = [.. a];
-        for (int i = 0; i < myList.Count; i++)
+        for (int i = 0; i <= myList.Count; i++)
         {
             for (int j = i + 1; j < myList.Count; j++)

[Killed] Arithmetic mutation
src/mydotnet/hellolib/TwoSum.cs:40:26
         List<int> myList = [.. a];
         for (int i = 0; i < myList.Count; i++)
         {
-            for (int j = i + 1; j < myList.Count; j++)
+            for (int j = i - 1; j < myList.Count; j++)
             {
                 if (myList[i] + myList[j] == X)
killedBy: tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen

[Killed] PostIncrementExpression to PostDecrementExpression mutation
src/mydotnet/hellolib/TwoSum.cs:40:51
         List<int> myList = [.. a];
         for (int i = 0; i < myList.Count; i++)
         {
-            for (int j = i + 1; j < myList.Count; j++)
+            for (int j = i + 1; j < myList.Count; j--)
             {
                 if (myList[i] + myList[j] == X)
killedBy: tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen

[Killed] Arithmetic mutation
src/mydotnet/hellolib/TwoSum.cs:42:21
         {
             for (int j = i + 1; j < myList.Count; j++)
             {
-                if (myList[i] + myList[j] == X)
+                if (myList[i] - myList[j] == X)
                 {
                     return true;
killedBy: tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen; tests.TwoSumTests.SumExistsInCheckExistsTen

[Killed] Equality mutation
src/mydotnet/hellolib/TwoSum.cs:42:21
         {
             for (int j = i + 1; j < myList.Count; j++)
             {
-                if (myList[i] + myList[j] == X)
+                if (myList[i] + myList[j] != X)
                 {
                     return true;
killedBy: tests.TwoSumTests.SumDoesNotExistInCheckExistsTen; tests.TwoSumTests.SumDoesNotExistInCheckExistsTen; tests.TwoSumTests.SumDoesNotExistInCheckExists
