[Killed] Negate expression
src/mydotnet/hellolib/Weather.cs:15:13
 
         HttpResponseMessage response = await _httpClient.GetAsync(url);
 
-        if (response.IsSuccessStatusCode)
+        if (!(response.IsSuccessStatusCode))
         {
             string content = await response.Content.ReadAsStringAsync();
killedBy: tests.WeatherTests.GetCurrentWeatherAsync_ReturnsCurrentWeather_WhenRequestIsSuccessfulAndDataIsEmpty; tests.WeatherTests.GetCurrentWeatherAsync_ReturnsCurrentWeather_WhenRequestIsSuccessfulAndDataIsPartial; tests.WeatherTests.GetCurrentWeatherAsync_ReturnsCurrentWeather_WhenRequestIsSuccessful

[Killed] Block removal mutation
src/mydotnet/hellolib/Weather.cs:16:9
         HttpResponseMessage response = await _httpClient.GetAsync(url);
 
         if (response.IsSuccessStatusCode)
-        {
-            string content = await response.Content.ReadAsStringAsync();
-
-            CurrentWeather currentWeather = JsonSerializer.Deserialize<CurrentWeather>(content);
-
-            return currentWeather;
-        }
+        {}
         else
         {
killedBy: tests.WeatherTests.GetCurrentWeatherAsync_ReturnsCurrentWeather_WhenRequestIsSuccessfulAndDataIsEmpty; tests.WeatherTests.GetCurrentWeatherAsync_ReturnsCurrentWeather_WhenRequestIsSuccessfulAndDataIsPartial; tests.WeatherTests.GetCurrentWeatherAsync_ReturnsCurrentWeather_WhenRequestIsSuccessful

[Survived] Statement mutation
src/mydotnet/hellolib/Weather.cs:25:13
         }
         else
         {
-            throw new WeatherFetchException($"Failed to get weather information: {response.StatusCode}");
+            ;
         }
     }
